JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_i3c.c
static void I3C_TransferStateMachineSendCommandState(I3C_Type *base,
                                                     i3c_master_handle_t *handle,
                                                     i3c_master_state_machine_param_t *stateParams)
{
    assert(NULL != base && NULL != handle && NULL != stateParams);
    I3C_MasterEnableInterrupts(base, (uint32_t)kI3C_MasterTxReadyFlag);
    /* Make sure there is room in the tx fifo for the next command. */
    if (0UL == (stateParams->txCount)--)
    {
        stateParams->state_complete = true;
        return;
    }
    if (handle->transfer.subaddressSize > 1U)
    {
        handle->transfer.subaddressSize--;
        base->MWDATAB = (uint8_t)((handle->transfer.subaddress) >> (8U * handle->transfer.subaddressSize));
    }
    else if (handle->transfer.subaddressSize == 1U)
    {
        handle->transfer.subaddressSize--;

        if ((handle->transfer.direction == kI3C_Read) || (0UL == handle->transfer.dataSize))
        {
            base->MWDATABE = (uint8_t)((handle->transfer.subaddress) >> (8U * handle->transfer.subaddressSize));

            if (handle->transfer.busType != kI3C_TypeI3CDdr)
            {
                if (0UL == handle->transfer.dataSize)
                {
                    handle->state = (uint8_t)kWaitForCompletionState;
                }
                else
                {
                    /* xfer->dataSize != 0U, xfer->direction = kI3C_Read */
                    handle->state = (uint8_t)kWaitRepeatedStartCompleteState;
                }
            }
            else
            {
                handle->state = (uint8_t)kTransferDataState;
            }
        }
        else
        {
            /* Next state, transfer data. */
            handle->state = (uint8_t)kTransferDataState;
            base->MWDATAB = (uint8_t)((handle->transfer.subaddress) >> (8U * handle->transfer.subaddressSize));
        }
    }
    else
    {
        /* Eliminate misra 15.7*/
    }
}

static void I3C_TransferStateMachineWaitRepeatedStartCompleteState(I3C_Type *base,
                                                                   i3c_master_handle_t *handle,
                                                                   i3c_master_state_machine_param_t *stateParams)
{
    assert(NULL != base && NULL != handle && NULL != stateParams);
    /* We stay in this state until the master complete. */
    if (0UL != (stateParams->status & (uint32_t)kI3C_MasterCompleteFlag))
    {
        handle->state = (uint8_t)kTransferDataState;
        I3C_MasterDisableInterrupts(base, (uint32_t)kI3C_MasterTxReadyFlag);

        if (handle->remainingBytes < 256U)
        {
            handle->rxTermOps = (handle->rxTermOps == kI3C_RxTermDisable) ? handle->rxTermOps : kI3C_RxAutoTerm;
            stateParams->result =
                I3C_MasterRepeatedStartWithRxSize(base, handle->transfer.busType, handle->transfer.slaveAddress,
                                                  kI3C_Read, (uint8_t)handle->remainingBytes);
        }
        else
        {
            stateParams->result =
                I3C_MasterRepeatedStart(base, handle->transfer.busType, handle->transfer.slaveAddress, kI3C_Read);
        }
    }

    stateParams->state_complete = true;
}

static void I3C_TransferStateMachineTransferDataState(I3C_Type *base,
                                                      i3c_master_handle_t *handle,
                                                      i3c_master_state_machine_param_t *stateParams)
{
    assert(NULL != base && NULL != handle && NULL != stateParams);

    i3c_puint8_to_u32_t dataBuff;
    if (handle->transfer.direction == kI3C_Write)
    {
        /* Make sure there is room in the tx fifo. */
        if (0UL == (stateParams->txCount)--)
        {
            stateParams->state_complete = true;
            return;
        }

        /* Put byte to send in fifo. */
        dataBuff.puint8 = (uint8_t *)handle->transfer.data;
        if (handle->transfer.dataSize > 1U)
        {
            base->MWDATAB = *dataBuff.puint8;
        }
        else
        {
            base->MWDATABE = *dataBuff.puint8;
        }
        dataBuff.u32 = dataBuff.u32 + 1U;
        (handle->transfer.dataSize)--;
        handle->transfer.data = (void *)(dataBuff.puint8);

        /* Move to stop when the transfer is done. */
        if (--handle->remainingBytes == 0UL)
        {
            handle->state = (uint8_t)kWaitForCompletionState;
        }
    }
    else
    {
        /* Make sure there is data in the rx fifo. */
        if (0UL == (stateParams->rxCount)--)
        {
            stateParams->state_complete = true;
            return;
        }

        /* Read byte from fifo. */
        dataBuff.puint8       = (uint8_t *)handle->transfer.data;
        *dataBuff.puint8      = (uint8_t)base->MRDATAB;
        dataBuff.u32          = dataBuff.u32 + 1U;
        handle->transfer.data = (void *)(dataBuff.puint8);

        /* Move to stop when the transfer is done. */
        if (--handle->remainingBytes == 0UL)
        {
            handle->state = (uint8_t)kWaitForCompletionState;
        }

        if ((handle->rxTermOps == kI3C_RxTermLastByte) && (handle->remainingBytes == 1UL))
        {
            base->MCTRL |= I3C_MCTRL_RDTERM(1UL);
        }
    }
}

static void I3C_TransferStateMachineWaitForCompletionState(i3c_master_handle_t *handle,
                                                           i3c_master_state_machine_param_t *stateParams)
{
    /* We stay in this state until the maste complete. */
    if (0UL != (stateParams->status & (uint32_t)kI3C_MasterCompleteFlag))
    {
        handle->state = (uint8_t)kStopState;
    }
    else
    {
        stateParams->state_complete = true;
    }
}

static void I3C_TransferStateMachineStopState(I3C_Type *base,
                                              i3c_master_handle_t *handle,
                                              i3c_master_state_machine_param_t *stateParams)
{
    /* Only issue a stop transition if the caller requested it. */
    if (0UL == (handle->transfer.flags & (uint32_t)kI3C_TransferNoStopFlag))
    {
        /* Make sure there is room in the tx fifo for the stop command. */
        if (0UL == (stateParams->txCount)--)
        {
            stateParams->state_complete = true;
            return;
        }
        if (handle->transfer.busType == kI3C_TypeI3CDdr)
        {
            I3C_MasterEmitRequest(base, kI3C_RequestForceExit);
        }
        else
        {
            (void)I3C_MasterEmitStop(base, false);
        }
    }
    stateParams->state_complete = true;
}

static status_t I3C_RunTransferStateMachine(I3C_Type *base, i3c_master_handle_t *handle, bool *isDone)
{
    i3c_master_state_machine_param_t stateParams;
    (void)memset(&stateParams, 0, sizeof(stateParams));

    stateParams.result         = kStatus_Success;
    stateParams.state_complete = false;

    /* Set default isDone return value. */
    *isDone = false;

    uint32_t errStatus;
    size_t txFifoSize =
        2UL << ((base->SCAPABILITIES & I3C_SCAPABILITIES_FIFOTX_MASK) >> I3C_SCAPABILITIES_FIFOTX_SHIFT);

